[M_Orchid_PlotMission07 MissionDefinition]
MissionName="FILLING!"
MissionDescription="When you tried to remove the tip of the Warrior Blade cartridge from the case, you accidentally broke it. After a while, Herbert will offer help. If we look at examples of polymer clays [place]Bathroom accessories factory[-place], Herbert was able to repair part of the ring that was accidentally damaged."
TurnInDescription="Move! After the last part is solved, you can take Captain Blade's computer and reveal the location of the sand treasure.."
MissionSummary="Captain Compass last episode."
MissionGiver="A self-effacing person"
MissionTurnInLocation="Captain Scarlett"
TeaserText=""

[M_Orchid_PlotMission07:CollectItems MissionObjectiveDefinition]
ProgressMessage="Take Polycritus."

[M_Orchid_PlotMission07:CollectItemSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:CollectItemsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:Dummy MissionObjectiveDefinition]
ProgressMessage="new york "

[M_Orchid_PlotMission07:DummySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:EnterRefinery MissionObjectiveDefinition]
ProgressMessage="In the Botnia factory"

[M_Orchid_PlotMission07:GivePackage MissionObjectiveDefinition]
ProgressMessage="Give Herbert a present"

[M_Orchid_PlotMission07:GivePackageSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="He was still trying to get Captain Blade's last gesture off his chest. He did it without thinking. Fortunately, Herbert helped with the arrangement. All that's left is to see the Scarlet Captain with the compass, oh... and about Herbert's gift.."

[M_Orchid_PlotMission07:GivePolykryten MissionObjectiveDefinition]
ProgressMessage="Give Herbert more personality"

[M_Orchid_PlotMission07:GivePolykrytenSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:GotoRefinerySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:KillLoaderBoss MissionObjectiveDefinition]
ProgressMessage="Turn off the H3RL-E"

[M_Orchid_PlotMission07:KillLoaderBossSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:ReturnFinalSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="You accidentally broke the compass while trying to pull the last commander's sword from his chest. Fortunately, Herbert fixed it. Now that Captain Scarlet and the compass are left, you might as well take a shower."

[M_Orchid_PlotMission07:ReturnToHermit MissionObjectiveDefinition]
ProgressMessage="Back to Herbert"

[M_Orchid_PlotMission07:ReturnToHermitSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:ReturnToPirateQueen MissionObjectiveDefinition]
ProgressMessage="Back to Captain Scarlet."

[M_Orchid_PlotMission07:ReturnToPirateQueenSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission07:TakeCompass MissionObjectiveDefinition]
ProgressMessage="It is part of the Herbert campus."

[M_Orchid_PlotMission07:TakeCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="When you try to get the last piece of the master piece out of the box, fall apart. Herbert is a little worried about the situation and wants to solve the problem again.."

